public enum Planet {
    EARTH("Жер планетасында жан бар жана орточо температурасы 14,8С"),
    MARS("Марс жер планетасына окшош"),
    SATURN("Сатурн Кундон алыстыгы боюнча 6 оорунда турат кун" + " системасында чондугу боюнча Юпитерден кийинки экинчи планета "),
    MERCURY("Меркурий кун системасында эн кичине жана кунго эн жакын планета "),
    NEPTUNE("Нептун кун системасында 8 оорунда турат жана кун систесанды эн алыскы турган планнета"),
    URANUS("Уранус 1981-жылы англис астраному Уильям Гершел тарабынан ачылып грек кудайы Урандын атынан коюлган"),
    JUPITER("Юпитер Кун системасында эн чон планета кундон алыстыгы боюнча 5-оорунда турат орточо температурасы -108С"),
    VENUS("Венера кун системасында 2 чи оорунда,колому боюнча 6-оорундатурат,орточо температурасы 468С");

    private  String planet;

    Planet(String planet) {
        this.planet = planet;
    }

    public String getPlanet() {
        return planet;
    }

    public void setPlanet(String planet) {
        this.planet = planet;
    }
}
